Veen_OpenFOAM_Cases-main/2D_Plane_LES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)    //0
    (8 0 0)
    (8 2 0)
    (8.2 2 0)
    (8.2 0 0)
    (60 0 0)    //5
    (60 2 0)
    (60 8 0)
    (0 8 0)
    (0 2 0)    //9
    (0 0 1)
    (8 0 1)
    (8 2 1)
    (8.2 2 1)
    (8.2 0 1)
    (60 0 1)
    (60 2 1)
    (60 8 1)
    (0 8 1)
    (0 2 1)
    (8 8 0)    //20
    (8.2 8 0)
    (8 8 1)    //22
    (8.2 8 1)
);

blocks
(
    hex (0 1 2 9 10 11 12 19) 
        (160 40 1) 
    simpleGrading (1 1 1)
    
    hex (9 2 20 8 19 12 22 18) 
        (160 120 1) 
    simpleGrading (1 1 1)
    
    hex (2 3 21 20 12 13 23 22) 
        (4 120 1) 
    simpleGrading (1 1 1)
    
    hex (3 6 7 21 13 16 17 23) 
        (1036 120 1) 
    simpleGrading (1 1 1)
    
    hex (4 5 6 3 14 15 16 13) 
        (1036 40 1) 
    simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 19 9)
            (9 19 18 8)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 15 16 6)
            (6 16 17 7)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 1 10 11)
            (1 11 12 2)
            (2 3 13 12)
            (3 4 14 13)
            (4 5 15 14)
            (8 20 22 18)
            (20 21 23 22)
            (21 7 17 23)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 9)
            (9 2 20 8)
            (2 3 21 20)
            (3 6 7 21)
            (4 5 6 3)
            (10 11 12 19)
            (19 12 22 18)
            (12 13 23 22)
            (13 16 17 23)
            (14 15 16 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
